Merge pull request #34 from DanhDue/epic/settings-bugfixes
Epic/settings bugfixes
